#Даны два числа. Показать большее и меньшее число
a=25
b=50
if a>b:
    print(f'max {a} min {b}')
else:
    print(f'min {a} max {b}')