# 27. Определить количество цифр в числе

number=(input('Введите число:'))
def count_elements(number):   
    return len(number)
print(count_elements(number))