#15. Дано число. Проверить кратно ли оно 7 и 23
a = int(input('Введите число:' ))
print (a % 7 == 0 and a % 23 == 0)

