# 29. Написать программу вычисления произведения чисел от 1 до N
a = 1
for i in range(1,15):
    a = a * i
    print(a)


