# Написать программу вычисления значения функции y = f(a)
import math
def function (x,a):
    y=math.sin(x)+a
    return y    
print(function(1,10))


